#https://www.ect.go.th/ect_th/ewt_dl_link.php?nid=4230
import math
import operator  
import os

FLAG_SORSOR_IS_INTEGER = (os.getenv('FLAG_SORSOR_IS_INTEGER', 'True'))
จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎร = 500
จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ = 150
คะแนนรวมรายพรรค = {
"พลังประชารัฐ":8433137,
"เพื่อไทย":7920630,
"อนาคตใหม่":6265950,
"ประชาธิปัตย์":3947726,
"ภูมิใจไทย":3732883,
"เสรีรวมไทย":826530,
"ชาติไทยพัฒนา":782031,
"เศรษฐกิจใหม่":485664,
"ประชาชาติ":485436,
"เพื่อชาติ":419393,
"รวมพลังประชาชาติไทย":416324,
"ชาติพัฒนา":252044,
"พลังท้องถิ่นไท":212620,
"รักษ์ผืนป่าประเทศไทย":136597,
"พลังปวงชนไทย":81733,
"พลังชาติไทย":73871,
"ประชาภิวัฒน์":69417,
"พลังไทยรักไทย":60840,
"ไทยศรีวิไลย์":60421,
"ประชานิยม":56617,
"ครูไทยเพื่อประชาชน":56339,
"ประชาธรรมไทย":47848,
"ประชาชนปฏิรูป":45508,
"พลเมืองไทย":44766,
"ประชาธิปไตยใหม่":39792,
"พลังธรรมใหม่":35533,
"ไทรักธรรม":33748,
"เพื่อแผ่นดิน":31307,
"ทางเลือกใหม่":29607,
"ภราดรภาพ":27799,
"พลังประชาธิปไตย":26617,
"เพื่อคนไทย":26598,
"พลังไทสร้างชาติ":23059,
"กรีน":22662,
"แผ่นดินธรรม":21463,
"มหาชน":17867,
"พลังสังคม":17683,
"เครือข่ายชาวนาแห่งประเทศไทย":17664,
"แทนคุณแผ่นดิน":17112,
"สยามพัฒนา":16839,
"เพื่อธรรม":15365,
"รวมใจไทย":13457,
"คลองไทย":12946,
"ผึ้งหลวง":12576,
"ภาคีเครือข่ายไทย":12268,
"ประชากรไทย":11839,
"ประชาไทย":11043,
"ชาติพันธุ์ไทย":9757,
"พลังไทยรักชาติ":9685,
"พลังศรัทธา":9561,
"ความหวังใหม่":9074,
"เพื่อไทยพัฒนา":8095,
"ถิ่นกาขาวชาววิไล":6799,
"พลังครูไทย":6398,
"ไทยธรรม":5942,
"กลาง":5447,
"สังคมประชาธิปไตยไทย":5334,
"สามัญชน":5321,
"ฐานรากไทย":4786,
"พลังรัก":4624,
"พลังแผ่นดินทอง":4568,
"ไทยรุ่งเรือง":4237,
"รักท้องถิ่นไทย":3763,
"ภูมิพลังเกษตรกรไทย":3535,
"พลังแรงงานไทย":2951,
"พลังไทยดี":2536,
"คนธรรมดาแห่งประเทศไทย":2353,
"พลังสหกรณ์":2343,
"เพื่อชีวิตใหม่":1595,
"พัฒนาประเทศไทย":1079,
"เพื่อสหกรณ์ไทย":905,
"มติประชา":791,
"ยางพาราไทย":610,
"ประชาธิปไตยเพื่อประชาชน":562,
"รักษ์ธรรม":446,
"อนาคตไทย":198,
"กสิกรไทย":183,
"คนงานไทย":0,
"พลังคนกีฬา":0,
"เพื่อนไทย":0,
"ไทยรักษาชาติ":0

}

จำนวนสสเขตรายพรรค = {
    "พลังประชารัฐ" : 97,
    "เพื่อไทย" : 137,
    "อนาคตใหม่" : 30,
    "ประชาธิปัตย์" : 33,
    "ภูมิใจไทย" : 39,
    "ชาติไทยพัฒนา" : 6,
    "ประชาชาติ": 6,
    "รวมพลังประชาชาติไทย":1,
    "ชาติพัฒนา":1
}

จำนวนสสรายพรรค = {}
สมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ = {}
สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น = {}
สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้ = {}
สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5 = {}

พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5 = [] 
เศษจากการคํานวณ = {}
 
# (๑) นําคะแนนรวมทั้งประเทศที่พรรคการเมืองทุกพรรคที่ส่งผู้สมัครแบบบัญชีรายชื่อได้รับ
# จากการเลือกตั้งแบบแบ่งเขตเลือกตั้งหารด้วยห้าร้อยอันเป็นจํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎร
def มาตรา128วรรค1():
    return sum(คะแนนรวมรายพรรค.values())/จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎร

# (๒) นําผลลัพธ์ตาม (๑) ไปหารจํานวนคะแนนรวมทั้งประเทศของพรรคการเมืองแต่ละพรรค
# ที่ได้รับจากการเลือกตั้งแบบแบ่งเขตเลือกตั้งทุกเขต จํานวนที่ได้รับให้ถือเป็นจํานวนสมาชิกสภาผู้แทนราษฎร
# ที่พรรคการเมืองนั้นจะพึงมีได้เบื้องต้น และเมื่อได้คํานวณตาม (๕) (๖) หรือ (๗) ถ้ามีแล้ว จึงให้ถือว่า
# เป็นจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้
def มาตรา128วรรค2(คะแนนรวมทั้งประเทศของพรรคการเมืองแต่ละพรรค):
    จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ = คะแนนรวมทั้งประเทศของพรรคการเมืองแต่ละพรรค/มาตรา128วรรค1()
    return จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้

# (๓) นําจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองจะพึงมีได้ตาม (๒) ลบด้วยจํานวน
# สมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้งทั้งหมดที่พรรคการเมืองนั้นได้รับเลือกตั้งในทุกเขตเลือกตั้ง
# ผลลัพธ์คือจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองนั้นจะได้รับเบื้องต้น
def มาตรา128วรรค3(จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองจะพึงมีได้ตาม2,จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้งทั้งหมดที่พรรคการเมืองนั้นได้รับเลือกตั้งในทุกเขตเลือกตั้ง):
    จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองนั้นจะได้รับเบื้องต้น = จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองจะพึงมีได้ตาม2-จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้งทั้งหมดที่พรรคการเมืองนั้นได้รับเลือกตั้งในทุกเขตเลือกตั้ง
    return จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองนั้นจะได้รับเบื้องต้น

# (๔) ภายใต้บังคับ (๕) ให้จัดสรรจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมือง
# จะได้รับให้ครบหนึ่งร้อยห้าสิบคน โดยจัดสรรให้พรรคการเมืองตามผลลัพธ์ตาม (๓) เป็นจํานวนเต็มก่อน
# หากยังไม่ครบจํานวนหนึ่งร้อยห้าสิบคน ให้พรรคการเมืองที่มีเศษจากการคํานวณมากที่สุดได้รับการจัดสรร
# จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มอีกหนึ่งคนตามลําดับจนครบจํานวนหนึ่งร้อยห้าสิบคน
# ในกรณีมีเศษเท่ากัน ให้ดําเนินการตาม (๖) 
def มาตรา128วรรค4():
    มาตรา128วรรค5()


# (๕) ถ้าพรรคการเมืองใดมีผู้ได้รับเลือกตั้งเป็นสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# เท่ากับหรือสูงกว่าสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ให้พรรคการเมืองนั้น
# มีสมาชิกสภาผู้แทนราษฎรตามจํานวนที่ได้รับจากการเลือกตั้งแบบแบ่งเขตเลือกตั้ง และไม่มีสิทธิได้รับ
# การจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ และให้นําจํานวนสมาชิกสภาผู้แทนราษฎร
# แบบบัญชีรายชื่อทั้งหมดไปจัดสรรให้แก่พรรคการเมืองที่มีจํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# ต่ํากว่าจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ตามอัตราส่วน แต่ต้อง
# ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 
def จัดสรรสสตามมาตรา5_วรรค6หรือ7():
    if sum(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้.values()) > จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
       print("สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้ ตามวรรค 5 มากกว่า 150 ต้องคำนวณตามวรรค 7 ->"+str(sum(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้.values())))
       มาตรา128วรรค7(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้)
    elif sum(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้.values()) < จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
       print("สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้ ตามวรรค 5 น้อยกว่า 150 ต้องคำนวณตามวรรค 6 ->"+str(sum(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้.values())))
       มาตรา128วรรค6(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น,สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้)
    else:
       print("สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้ เท่ากับ 150 - จบการคำนวณ")

def จัดสรรสสตามมาตรา5():
    if FLAG_SORSOR_IS_INTEGER=='True': 
        for พรรค in พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
            สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค] = คำนวณจำนวนสสแบบปัดลง(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค])
        จัดสรรสสตามมาตรา5_วรรค6หรือ7()
    else:
        #เกลี่ยให้ทุกพรรค
        #TODO ต้องเช็คด้วยว่าเกลี่ยแล้วไม่เกินจำนวนพึงมี
        for พรรค in พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
            สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค] = สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค]*จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ/sum(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น.values())
        จัดสรรสสตามมาตรา5_วรรค6หรือ7()

 

    
# (๕) ถ้าพรรคการเมืองใดมีผู้ได้รับเลือกตั้งเป็นสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# เท่ากับหรือสูงกว่าสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ให้พรรคการเมืองนั้น
# มีสมาชิกสภาผู้แทนราษฎรตามจํานวนที่ได้รับจากการเลือกตั้งแบบแบ่งเขตเลือกตั้ง และไม่มีสิทธิได้รับ
# การจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ และให้นําจํานวนสมาชิกสภาผู้แทนราษฎร
# แบบบัญชีรายชื่อทั้งหมดไปจัดสรรให้แก่พรรคการเมืองที่มีจํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# ต่ํากว่าจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ตามอัตราส่วน แต่ต้อง
# ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 
def มาตรา128วรรค5():
    ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ = False
    for พรรค,จำนวนเบื้องต้น in สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น.items():
        if จำนวนเบื้องต้น < 0:
            สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = 0
            ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ = True
    if ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
        for พรรค in สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น:
            if พรรค in จำนวนสสเขตรายพรรค:
               จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง = จำนวนสสเขตรายพรรค[พรรค]
            else:
                จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง = 0
            if จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง < สมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค]:
                # ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 
                # การคิดจำนวน สส จะแตกต่างกันตรงนี้
                if FLAG_SORSOR_IS_INTEGER=='True': 
                    if สมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค] >= 1:
                       พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5.append(พรรค)
                else: 
                    พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5.append(พรรค)
    จัดสรรสสตามมาตรา5()

# (๖) ในการจัดสรรตาม (๕) แล้วปรากฏว่ายังจัดสรรจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ
# ไม่ครบหนึ่งร้อยห้าสิบคน ให้พรรคการเมืองที่มีเศษจากการคํานวณมากที่สุดได้รับการจัดสรรจํานวนสมาชิก
# สภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มอีกหนึ่งคนตามลําดับจนครบจํานวนหนึ่งร้อยห้าสิบคน กรณีที่เศษที่เหลือ
# ของแต่ละพรรคการเมืองเท่ากันจนทําให้ไม่สามารถจัดสรรสมาชิกสภาผ้แทนราษฎรแบบบ ู ัญชีรายชื่อได้ครบจํานวน
# หนึ่งร้อยห้าสิบคน ให้นําค่าเฉลี่ยคะแนนของแต่ละพรรคการเมืองต่อจํานวนสมาชิกสภาผู้แทนราษฎร
# ที่พึงมีหนึ่งคนมาพิจารณา โดยหากพรรคการเมืองใดมีค่าเฉลี่ยคะแนนของพรรคการเมืองต่อจํานวน
# สมาชิกสภาผู้แทนราษฎรที่พึงมีหนึ่งคนมากกว่าพรรคการเมืองอื่น ให้พรรคการเมืองนั้นมีสิทธิได้รับ
# การจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มอีกหนึ่งคน และหากยังมีจํานวนค่าเฉลี่ยดังกล่าว
# เท่ากันอีก ให้ใช้วิธีจับสลาก
def มาตรา128วรรค6(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น,จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้):
 
    for พรรค in สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น:
        เศษจากการคํานวณ[พรรค] = สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] - จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค]
        สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค] = คำนวณจำนวนสสแบบปัดลง(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค])
    
    รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 = sum(สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5.values())

    if รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 < จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
       จำนวนสสที่ต้องจัดสรรเพิ่มเติม = จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ - รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5
       print("จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค 5 ต้องจัดสรรเพิ่มตามมาตรา 4 "+str(จำนวนสสที่ต้องจัดสรรเพิ่มเติม)+" คน")
       จัดสรรจำนวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มตามวรรค4(จำนวนสสที่ต้องจัดสรรเพิ่มเติม)        
        
    else:
         raise Exception('รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 ที่ผ่านวรรค 7 ต้องไม่เกิน 150 -> '+ str(สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5))

 
#  (๗) ในกรณีที่เมื่อคํานวณตาม (๕) แล้วปรากฏว่าพรรคการเมืองทุกพรรคได้รับจํานวน
# สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อรวมกันแล้วเกินหนึ่งร้อยห้าสิบคน ให้ดําเนินการคํานวณปรับ
# จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อใหม่โดยคํานวณตามอัตราส่วนที่ทุกพรรคจะได้รับการจัดสรร
# จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อซึ่งเมื่อรวมแล้วไม่เกินหนึ่งร้อยห้าสิบคน โดยให้นําจํานวน
# สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่แต่ละพรรคการเมืองจะได้รับคูณด้วยหนึ่งร้อยห้าสิบ หารด้วย
# ผลบวกของหนึ่งร้อยห้าสิบกับจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่เกินจํานวนหนึ่งร้อยห้าสิบ
# และให้นํา (๔) มาใช้ในการคํานวณด้วยโดยอนุโลม
def มาตรา128วรรค7(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้):
     
    for พรรค in จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้:
        สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค] = จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค]*จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ/sum(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้.values())
        เศษจากการคํานวณ[พรรค] = สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค] - คำนวณจำนวนสสแบบปัดลง(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค])
        สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค] = คำนวณจำนวนสสแบบปัดลง(สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่คำนวณได้[พรรค])

    รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 = sum(สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5.values())

    if รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 < จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
       จำนวนสสที่ต้องจัดสรรเพิ่มเติม = จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎรแบบบัญชีรายชื่อ - รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5
       print("จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค 5 ต้องจัดสรรเพิ่มตามมาตรา 4 "+str(จำนวนสสที่ต้องจัดสรรเพิ่มเติม)+" คน")
       จัดสรรจำนวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มตามวรรค4(จำนวนสสที่ต้องจัดสรรเพิ่มเติม)
    else:
         raise Exception('รวมจํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่ได้รับจัดสรรคตามวรรค5 ที่ผ่านวรรค 7 ต้องไม่เกิน 150 -> '+ str(สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5))

def จัดสรรจำนวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อเพิ่มตามวรรค4(จำนวนสสที่ต้องจัดสรรเพิ่มเติม):
    for พรรค in sorted(เศษจากการคํานวณ.items(),key = operator.itemgetter(1),reverse = True)[:จำนวนสสที่ต้องจัดสรรเพิ่มเติม]: 
        print(str(พรรค) +" +1 คน")
        สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค[0]] = (สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค[0]]+1)


def คำนวณจำนวนสสแบบปัดลง(จำนวนสสทศนิยม):
    return math.floor(จำนวนสสทศนิยม)

def รวมจำนวนสสเขตและบัญชีรายชื่อ():
    if พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
        for พรรค in จำนวนสสเขตรายพรรค:
            if พรรค in สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5:
               จำนวนสสรายพรรค[พรรค] = จำนวนสสเขตรายพรรค[พรรค]+สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค]
            else:
               จำนวนสสรายพรรค[พรรค] = จำนวนสสเขตรายพรรค[พรรค]
        for พรรค in สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5:
            if พรรค not in จำนวนสสเขตรายพรรค:
               จำนวนสสรายพรรค[พรรค] = สมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามวรรค5[พรรค]
    else:
        #TODO
        return

def จำนวนสสคำนวณต้องได้500คน(จำนวนสสรายพรรค):
    print("จำนวนรวม สส ที่ คำนวณได้ "+ str(sum(จำนวนสสรายพรรค.values())))
    if sum(จำนวนสสรายพรรค.values()) != 500:
        return False
    return True

def คิดจำนวนสสแบบบัญชีรายชื่อ():

    #คำนวณ สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น
    for พรรค in คะแนนรวมรายพรรค:
        สมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค] = มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค])
        if พรรค in จำนวนสสเขตรายพรรค:
            สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = มาตรา128วรรค3(มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค]),จำนวนสสเขตรายพรรค[พรรค])
        else:
            สมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = มาตรา128วรรค3(มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค]),0)
    มาตรา128วรรค4()
 
 
 
#คำนวณคะแนน สส บัญชีรายชื่อ ตามมาตรา 128 วรรค 4
if FLAG_SORSOR_IS_INTEGER=='True':
    print("คำนวณ สส แบบ พรรค ที่เกิน 1 ตาม วรรค 5")
else:
    print("คำนวณ สส แบบ คิดทุกพรรค ตาม วรรค 5")

คิดจำนวนสสแบบบัญชีรายชื่อ()
รวมจำนวนสสเขตและบัญชีรายชื่อ()
print(จำนวนสสรายพรรค)
print("สส ได้ 500 คน "+str(จำนวนสสคำนวณต้องได้500คน(จำนวนสสรายพรรค)))
