import math
import operator  
จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎร = 500
คะแนนรวมรายพรรค = {
"พลังประชารัฐ":8433137,
"เพื่อไทย":7920630,
"อนาคตใหม่":6265950,
"ประชาธิปัตย์":3947726,
"ภูมิใจไทย":3732883,
"เสรีรวมไทย":826530,
"ชาติไทยพัฒนา":782031,
"เศรษฐกิจใหม่":485664,
"ประชาชาติ":485436,
"เพื่อชาติ":419393,
"รวมพลังประชาชาติไทย":416324,
"ชาติพัฒนา":252044,
"พลังท้องถิ่นไท":212620,
"รักษ์ผืนป่าประเทศไทย":136597,
"พลังปวงชนไทย":81733,
"พลังชาติไทย":73871,
"ประชาภิวัฒน์":69417,
"พลังไทยรักไทย":60840,
"ไทยศรีวิไลย์":60421,
"ประชานิยม":56617,
"ครูไทยเพื่อประชาชน":56339,
"ประชาธรรมไทย":47848,
"ประชาชนปฏิรูป":45508,
"พลเมืองไทย":44766,
"ประชาธิปไตยใหม่":39792,
"พลังธรรมใหม่":35533,
"ไทรักธรรม":33748,
"เพื่อแผ่นดิน":31307,
"ทางเลือกใหม่":29607,
"ภราดรภาพ":27799,
"พลังประชาธิปไตย":26617,
"เพื่อคนไทย":26598,
"พลังไทสร้างชาติ":23059,
"กรีน":22662,
"แผ่นดินธรรม":21463,
"มหาชน":17867,
"พลังสังคม":17683,
"เครือข่ายชาวนาแห่งประเทศไทย":17664,
"แทนคุณแผ่นดิน":17112,
"สยามพัฒนา":16839,
"เพื่อธรรม":15365,
"รวมใจไทย":13457,
"คลองไทย":12946,
"ผึ้งหลวง":12576,
"ภาคีเครือข่ายไทย":12268,
"ประชากรไทย":11839,
"ประชาไทย":11043,
"ชาติพันธุ์ไทย":9757,
"พลังไทยรักชาติ":9685,
"พลังศรัทธา":9561,
"ความหวังใหม่":9074,
"เพื่อไทยพัฒนา":8095,
"ถิ่นกาขาวชาววิไล":6799,
"พลังครูไทย":6398,
"ไทยธรรม":5942,
"กลาง":5447,
"สังคมประชาธิปไตยไทย":5334,
"สามัญชน":5321,
"ฐานรากไทย":4786,
"พลังรัก":4624,
"พลังแผ่นดินทอง":4568,
"ไทยรุ่งเรือง":4237,
"รักท้องถิ่นไทย":3763,
"ภูมิพลังเกษตรกรไทย":3535,
"พลังแรงงานไทย":2951,
"พลังไทยดี":2536,
"คนธรรมดาแห่งประเทศไทย":2353,
"พลังสหกรณ์":2343,
"เพื่อชีวิตใหม่":1595,
"พัฒนาประเทศไทย":1079,
"เพื่อสหกรณ์ไทย":905,
"มติประชา":791,
"ยางพาราไทย":610,
"ประชาธิปไตยเพื่อประชาชน":562,
"รักษ์ธรรม":446,
"อนาคตไทย":198,
"กสิกรไทย":183,
"คนงานไทย":0,
"พลังคนกีฬา":0,
"เพื่อนไทย":0,
"ไทยรักษาชาติ":0

}

จำนวนสสเขตรายพรรค = {
    "พลังประชารัฐ" : 97,
    "เพื่อไทย" : 137,
    "อนาคตใหม่" : 30,
    "ประชาธิปัตย์" : 33,
    "ภูมิใจไทย" : 39,
    "ชาติไทยพัฒนา" : 6,
    "ประชาชาติ": 6,
    "รวมพลังประชาชาติไทย":1,
    "ชาติพัฒนา":1
}

จำนวนสสรายพรรค = {}
จํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ = {}
จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น = {}
จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้ = {}
จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5 = {}

พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5 = []
เศษสสจากการคำนวน = {}
เศษจากการคํานวณ = {}
คะแนนรวมทั้งประเทศทุกพรรค = sum(คะแนนรวมรายพรรค.values())
utf8stdout = open(1, 'w', encoding='utf-8', closefd=False)
print(คะแนนรวมรายพรรค,file=utf8stdout)
print(คะแนนรวมทั้งประเทศทุกพรรค)

def มาตรา128วรรค1():
    return sum(คะแนนรวมรายพรรค.values())/จํานวนสมาชิกทั้งหมดของสภาผู้แทนราษฎร

def มาตรา128วรรค2(คะแนนรวมทั้งประเทศของพรรคการเมืองแต่ละพรรค):
    จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ = คะแนนรวมทั้งประเทศของพรรคการเมืองแต่ละพรรค/มาตรา128วรรค1()
    return จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้

def มาตรา128วรรค3(จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองจะพึงมีได้ตาม2,จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้งทั้งหมดที่พรรคการเมืองนั้นได้รับเลือกตั้งในทุกเขตเลือกตั้ง):
    จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองนั้นจะได้รับเบื้องต้น = จํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองจะพึงมีได้ตาม2-จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้งทั้งหมดที่พรรคการเมืองนั้นได้รับเลือกตั้งในทุกเขตเลือกตั้ง
    return จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองนั้นจะได้รับเบื้องต้น

def มาตรา18วรรค4():
    มาตรา128วรรค5()
    if พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
        รวมจํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5 = sum(จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5.values())
        if รวมจํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5 < 150:
            จำนวนสสที่ต้องจัดสรรเพิ่มเติม = 150 - รวมจํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5
            print("ต้องจัดสรรเพิ่มตามมาตรา 4 "+str(จำนวนสสที่ต้องจัดสรรเพิ่มเติม)+" คน")
            print(sorted(เศษจากการคํานวณ.items(),key = operator.itemgetter(1),reverse = True)[:จำนวนสสที่ต้องจัดสรรเพิ่มเติม])
            for พรรค in sorted(เศษจากการคํานวณ.items(),key = operator.itemgetter(1),reverse = True)[:จำนวนสสที่ต้องจัดสรรเพิ่มเติม]: 
               จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5[พรรค[0]] = (จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5[พรรค[0]]+1)
            print(จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5)
        elif รวมจํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5 > 150:
            print("Error มาตรา18วรรค4")
        else:
            print(พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5)

    else:
        return


# (๕) ถ้าพรรคการเมืองใดมีผู้ได้รับเลือกตั้งเป็นสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# เท่ากับหรือสูงกว่าจํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ให้พรรคการเมืองนั้น
# มีสมาชิกสภาผู้แทนราษฎรตามจํานวนที่ได้รับจากการเลือกตั้งแบบแบ่งเขตเลือกตั้ง และไม่มีสิทธิได้รับ
# การจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ และให้นําจํานวนสมาชิกสภาผู้แทนราษฎร
# แบบบัญชีรายชื่อทั้งหมดไปจัดสรรให้แก่พรรคการเมืองที่มีจํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# ต่ํากว่าจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ตามอัตราส่วน แต่ต้อง
# ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 

def จัดสรรสสตามมาตรา5():
    for พรรค in พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
        จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค] = คำนวนจำนวนสส(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค])
    if sum(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้.values()) > 150:
        print("จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้ ตามมาตรา 5 มากกว่า 150 ->"+str(sum(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้.values())))
        มาตรา128วรรค7(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้)
    elif sum(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้.values()) < 150:
        print("จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้ ตามมาตรา 5 น้อยกว่า 150 ->"+str(sum(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้.values())))
        มาตรา128วรรค6(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น,จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้)
    else:
        print("จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้ เท่ากับ 150")
        print(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้)

    
# (๕) ถ้าพรรคการเมืองใดมีผู้ได้รับเลือกตั้งเป็นสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# เท่ากับหรือสูงกว่าจํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ให้พรรคการเมืองนั้น
# มีสมาชิกสภาผู้แทนราษฎรตามจํานวนที่ได้รับจากการเลือกตั้งแบบแบ่งเขตเลือกตั้ง และไม่มีสิทธิได้รับ
# การจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ และให้นําจํานวนสมาชิกสภาผู้แทนราษฎร
# แบบบัญชีรายชื่อทั้งหมดไปจัดสรรให้แก่พรรคการเมืองที่มีจํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง
# ต่ํากว่าจํานวนสมาชิกสภาผู้แทนราษฎรที่พรรคการเมืองนั้นจะพึงมีได้ตาม (๒) ตามอัตราส่วน แต่ต้อง
# ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 
def มาตรา128วรรค5():
    ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ = False
    for พรรค,จำนวนเบื้องต้น in จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น.items():
        if จำนวนเบื้องต้น < 0:
            จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = 0
            ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ = True
    if ไม่มีสิทธิได้รับการจัดสรรสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อ:
        for พรรค in จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น:
            if พรรค in จำนวนสสเขตรายพรรค:
               จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง = จำนวนสสเขตรายพรรค[พรรค]
            else:
                จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง = 0
            if จํานวนสมาชิกสภาผู้แทนราษฎรแบบแบ่งเขตเลือกตั้ง < จํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค]:
                # ไม่มีผลให้พรรคการเมืองใดดังกล่าวมีสมาชิกสภาผู้แทนราษฎรเกินจํานวนที่จะพึงมีได้ตาม (๒) 
                # สส เป็นบุคคล เป็นจำนวนนับ 
                if จํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค] >= 1:
                   พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5.append(พรรค)
    จัดสรรสสตามมาตรา5()

def มาตรา128วรรค6(จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น,จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้):
 
    for พรรค in จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น:
        เศษจากการคํานวณ[พรรค] = จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] - จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค]
 

def มาตรา128วรรค7(สมาชิกสภาผู้แทนราษฎรที่คำนวนได้):
     
    for พรรค in สมาชิกสภาผู้แทนราษฎรที่คำนวนได้:
        จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค] = สมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค]*150/sum(สมาชิกสภาผู้แทนราษฎรที่คำนวนได้.values())
        เศษจากการคํานวณ[พรรค] = จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค] - คำนวนจำนวนสส(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค])
        จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5[พรรค] = คำนวนจำนวนสส(จํานวนสมาชิกสภาผู้แทนราษฎรที่คำนวนได้[พรรค])
 

def คำนวนจำนวนสส(จำนวนสสทศนิยม):
    return math.floor(จำนวนสสทศนิยม)

def รวมจำนวนสสเขตและบัญชีรายชื่อ():
    if พรรคที่มีสิทธิได้รับการจัดสรรตามมาตรา5:
        for พรรค in จำนวนสสเขตรายพรรค:
            if พรรค in จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5:
               จำนวนสสรายพรรค[พรรค] = จำนวนสสเขตรายพรรค[พรรค]+จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5[พรรค]
            else:
               จำนวนสสรายพรรค[พรรค] = จำนวนสสเขตรายพรรค[พรรค]
        for พรรค in จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5:
            if พรรค not in จำนวนสสเขตรายพรรค:
               จำนวนสสรายพรรค[พรรค] = จํานวนสมาชิกสภาผู้แทนราษฎรที่ได้รับจัดสรรคตามมาตรา5[พรรค]
    else:
        #TODO
        return

def จำนวนสสคำนวนต้องได้500คน(จำนวนสส):
    print("จำนวนรวม สส ที่คำวณได้ "+ str(sum(จำนวนสส.values())))
    if sum(จำนวนสส.values()) != 500:
        return False
    return True


#คำนวน จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น
for พรรค in คะแนนรวมรายพรรค:
    จํานวนสมาชิกสภาผู้แทนราษฎรท่ีพรรคการเมืองนั้นจะพึงมีได้[พรรค] = มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค])
    if พรรค in จำนวนสสเขตรายพรรค:
        จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = มาตรา128วรรค3(มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค]),จำนวนสสเขตรายพรรค[พรรค])
    else:
        จํานวนสมาชิกสภาผู้แทนราษฎรแบบบัญชีรายชื่อที่พรรคการเมืองได้รับเบื้องต้น[พรรค] = มาตรา128วรรค3(มาตรา128วรรค2(คะแนนรวมรายพรรค[พรรค]),0)

 
มาตรา18วรรค4()
รวมจำนวนสสเขตและบัญชีรายชื่อ()
print(จำนวนสสรายพรรค)
print(จำนวนสสคำนวนต้องได้500คน(จำนวนสสรายพรรค))
